[x0,y0]=Euler('F',0,5,0,0.5);
plot(x0,y0,'bo');hold on;

[x1,y1]=EulerPro('F',0,5,0,0.5);
plot(x1,y1,'r*');hold on;

fplot(dsolve('Dy=x^2-4','y(0)=0','x'),[0,5]);

grid,xlabel('自变量 X'), ylabel('因变量 Y'), legend('数值解，向前欧拉方法，计算dy/dx=x^2-4，y(0)=0，h=0.5','数值解，改进欧拉方法，计算dy/dx=x^2-4，y(0)=0，h=0.5','精确解y=(x(x^2-12))/3，计算dy/dx=x^2-4，y(0)=0，h=0.5')
%legend('用四阶亚当斯显式公式计算dy/dx=1-(2xy)/(1+x^2)，y(0)=0在[0,2]上的数值解','用常用的四阶龙格-库塔公式计算dy/dx=1-(2xy)/(1+x^2)，y(0)=0在[0,2]上的数值解','dy/dx=1-(2xy)/(1+x^2)的精确解y=(x+1/3x^3)/(1+x^2)')