x0=0;b=2;y0=0;h=1/15;
a2=1/2; a3=1/2; a4=1;
b21=1/2; 
b31=0;b32=1/2;
b41=0;b42=0;b43=1;
c1=1/6;c2=2/6;c3=2/6;c4=1/6;
C=[c1,c2,c3,c4, a2,a3,a4, b21,b31,b32,b41,b42,b43];

[k,X,Y1,fxy,X2,Y2,X3,Y3]=Test(@funfcn,@fun,x0,b,C,y0,h);
%老师实现 X, Y1
%精确解 X, fxy
%我的实现加中间变量 X2, Y2
%我的实现 X3, Y3
e1=(fxy(1:31)'-Y3)';
e2=(fxy(1:31)'-Y1(1:31)')';

'下面的数据列从左到右依次是 1.证明 老师实现==我的实现加中间变量 2. 我的原始实现的误差 3.老师实现的误差 4. 我的实现的误差-老师实现的误差'
[(Y1(1:31)'-Y2)' e1 e2 (e1-e2)]
figure;
plot(X2, e1,'ro', X2,e2,'b+');
legend('我的实现的误差','老师的实现的误差')
